Autodesk.Revit.DB.ElementId.CompareTo(System.Object)
Compares two element ids. Implementation of System.IComparable interface
id: The ElementId to be compared with this ElementId.
Returns:  -1 if this element id is less than other id, 0 if equal, 1 if greater.